Tekla Open API Reference for Tekla Structures 2025
ViewCamera.UpVector Property
The camera up vector (controls the camera roll).
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector UpVector { get; set; }
Public Property UpVector As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
ViewCamera Class
Tekla.Structures.Model.UI Namespace